edward62740/ot-HS/Code/HS/STM32_WPAN/App/app_thread.c
}

void appSrpCb(void)
{
	if (coapConnectionEstablished)
		return;
	HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_1);
}
void appSrpDeinit(void)
{
	otSrpClientDisableAutoStartMode(sInstance);
}

void appSrpInit(void)
{
	otError error = OT_ERROR_NONE;
	srpRunning = true;
	char *hostName;
	otNetifAddress *self = otIp6GetUnicastAddresses(sInstance);
	uint8_t addr_prf = self->mAddress.mFields.m8[15];
	uint16_t size;
	hostName = otSrpClientBuffersGetHostNameString(sInstance, &size);
	char *HOST_NAME = malloc(sizeof(char) * size);
	snprintf(HOST_NAME, size, "OT-HS-%d", addr_prf);
	error |= otSrpClientSetHostName(sInstance, HOST_NAME);
	memcpy(hostName, HOST_NAME, sizeof(HOST_NAME) + 1);

	otSrpClientEnableAutoHostAddress(sInstance);

	otSrpClientBuffersServiceEntry *entry = NULL;
	char *string;

	entry = otSrpClientBuffersAllocateService(sInstance);

	entry->mService.mPort = 33434;
	char INST_NAME[32];
	snprintf(INST_NAME, 32, "%d", addr_prf);
	char *SERV_NAME = "";
	string = otSrpClientBuffersGetServiceEntryInstanceNameString(entry, &size);
	memcpy(string, INST_NAME, size);

	string = otSrpClientBuffersGetServiceEntryServiceNameString(entry, &size);
	memcpy(string, SERV_NAME, size);

	error |= otSrpClientAddService(sInstance, &entry->mService);

	entry = NULL;
	otSrpClientEnableAutoStartMode(sInstance, /* aCallback */appSrpCb, /* aContext */
			NULL);
	if (error != OT_ERROR_NONE)
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_SET);
}

/**
 * @brief  Trace the error or the warning reported.
 * @param  ErrId :
 * @param  ErrCode
 * @retval None
 */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode)
{
	/* USER CODE BEGIN APP_THREAD_Error_1 */

	/* USER CODE END APP_THREAD_Error_1 */
	switch (ErrId)
	{
	case ERR_REC_MULTI_MSG_FROM_M0:
		APP_THREAD_TraceError("ERROR : ERR_REC_MULTI_MSG_FROM_M0 ", ErrCode);
		break;
	case ERR_THREAD_SET_STATE_CB:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_STATE_CB ", ErrCode);
		break;
	case ERR_THREAD_SET_CHANNEL:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_CHANNEL ", ErrCode);
		break;
	case ERR_THREAD_SET_PANID:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_PANID ", ErrCode);
		break;
	case ERR_THREAD_IPV6_ENABLE:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_IPV6_ENABLE ", ErrCode);
		break;
	case ERR_THREAD_START:
		APP_THREAD_TraceError("ERROR: ERR_THREAD_START ", ErrCode);
		break;
	case ERR_THREAD_ERASE_PERSISTENT_INFO:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_ERASE_PERSISTENT_INFO ",
				ErrCode);
		break;
	case ERR_THREAD_SET_NETWORK_KEY:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_NETWORK_KEY ", ErrCode);
		break;
	case ERR_THREAD_CHECK_WIRELESS:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ", ErrCode);
		break;
		/* USER CODE BEGIN APP_THREAD_Error_2 */
	case ERR_THREAD_COAP_START:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_START ", ErrCode);
		break;
	case ERR_THREAD_COAP_ADD_RESSOURCE:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_ADD_RESSOURCE ",
				ErrCode);
		break;
	case ERR_THREAD_MESSAGE_READ:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_MESSAGE_READ ", ErrCode);
		break;
	case ERR_THREAD_COAP_SEND_RESPONSE:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_RESPONSE ",
				ErrCode);
		break;
	case ERR_THREAD_COAP_APPEND:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_APPEND ", ErrCode);
		break;
	case ERR_THREAD_COAP_SEND_REQUEST:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_REQUEST ", ErrCode);
		break;
	case ERR_THREAD_MSG_COMPARE_FAILED:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_MSG_COMPARE_FAILED ",
				ErrCode);
		break;
		/* USER CODE END APP_THREAD_Error_2 */
	default:
		APP_THREAD_TraceError("ERROR Unknown ", 0);
		break;
	}
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
/**
 * @brief This function is used to set the sleepyEndDevice mode
 *        and configure its pool period.
 *
 * @param None
 * @retval None
 */
void APP_THREAD_SetSleepyEndDeviceMode(void)
{
	otError error = OT_ERROR_NONE;

	/* Set the pool period to 5 sec. It means that when the device will enter
	 * in 'sleepy end device' mode, it will send an ACK_Request every 5 sec.
	 * This message will act as keep alive message.
	 */
	otLinkSetPollPeriod(sInstance, pollIntervalMs);

	/* Set the sleepy end device mode */
	OT_LinkMode.mRxOnWhenIdle = 0;
	OT_LinkMode.mDeviceType = 0;
	OT_LinkMode.mNetworkData = 0;

	error = otThreadSetLinkMode(sInstance, OT_LinkMode);
	if (error != OT_ERROR_NONE)
		APP_THREAD_Error(ERR_THREAD_LINK_MODE, error);

}

/**
 * @brief Thread initialization.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
	coapConnectionEstablished = false;

	otError error;

	static char aNetworkName[] = "\";

	otOperationalDataset aDataset;

	memset(&aDataset, 0, sizeof(otOperationalDataset));

	/*
	 * Fields that can be configured in otOperationDataset to override defaults:
	 *     Network Name, Mesh Local Prefix, Extended PAN ID, PAN ID, Delay Timer,
	 *     Channel, Channel Mask Page 0, Network Key, PSKc, Security Policy
	 */
	//aDataset.mActiveTimestamp.mSeconds             = 1;
	aDataset.mComponents.mIsActiveTimestampPresent = true;

	/* Set Channel to 15 */
	aDataset.mChannel = 15;
	aDataset.mComponents.mIsChannelPresent = true;

	/* Set Pan ID to 2222 */
	aDataset.mPanId = (otPanId) ;
	aDataset.mComponents.mIsPanIdPresent = true;

	/* Set Extended Pan ID to  */
	uint8_t extPanId[OT_EXT_PAN_ID_SIZE] =
	{ };
	memcpy(aDataset.mExtendedPanId.m8, extPanId,
			sizeof(aDataset.mExtendedPanId));
	aDataset.mComponents.mIsExtendedPanIdPresent = true;

	/* Set network key to  */
	uint8_t key[OT_NETWORK_KEY_SIZE] =
	{ };
	memcpy(aDataset.mNetworkKey.m8, key, sizeof(aDataset.mNetworkKey));
	aDataset.mComponents.mIsNetworkKeyPresent = true;

	/* Set Network Name */
	size_t length = strlen(aNetworkName);
	assert(length <= OT_NETWORK_NAME_MAX_SIZE);
	memcpy(aDataset.mNetworkName.m8, aNetworkName, length);
	aDataset.mComponents.mIsNetworkNamePresent = true;
	/* Set the Active Operational Dataset to this dataset */
	error = otDatasetSetActive(sInstance, &aDataset);
	error = otIp6SetEnabled(sInstance, true);
	if (error != OT_ERROR_NONE)
	{
		APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
	}
	error = otThreadSetEnabled(sInstance, true);
	if (error != OT_ERROR_NONE)
	{
		APP_THREAD_Error(ERR_THREAD_START, error);
	}
	/* USER CODE BEGIN DEVICECONFIG */
	/* Start the COAP server */
	error = otCoapStart(sInstance, OT_DEFAULT_COAP_PORT);
	if (error != OT_ERROR_NONE)
	{
		APP_THREAD_Error(ERR_THREAD_COAP_START, error);
	}
	/* Add COAP resources */
	otCoapAddResource(sInstance, &OT_Ressource);

	/* USER CODE END DEVICECONFIG */
}

/**
 * @brief Thread notification when the state changes.
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(pContext);

	/* USER CODE BEGIN APP_THREAD_STATENOTIF */

	/* USER CODE END APP_THREAD_STATENOTIF */

