edward62740/ot-HS/Code/HS/STM32_WPAN/App/app_thread.c
	if ((NotifFlags & (uint32_t) OT_CHANGED_THREAD_ROLE)
			== (uint32_t) OT_CHANGED_THREAD_ROLE)
	{
		switch (otThreadGetDeviceRole(sInstance))
		{
		case OT_DEVICE_ROLE_DISABLED:
			/* USER CODE BEGIN OT_DEVICE_ROLE_DISABLED */

			break;
		case OT_DEVICE_ROLE_DETACHED:
			/* USER CODE BEGIN OT_DEVICE_ROLE_DETACHED */
			//if(coapConnectionEstablished) APP_THREAD_DeviceConfig();
			break;
		case OT_DEVICE_ROLE_CHILD:
			/* USER CODE BEGIN OT_DEVICE_ROLE_CHILD */
			//HW_TS_Start(setThreadLpTimerId, (uint32_t) 1000);
			//if(!srpRunning) HW_TS_Start(srpRegisterTimerId, coapMessageIntervalMs);
			//SHCI_C2_RADIO_AllowLowPower(THREAD_IP, TRUE);
			break;
		case OT_DEVICE_ROLE_ROUTER:
			/* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
			//HW_TS_Start(setThreadLpTimerId, (uint32_t) 1000);
			break;
		case OT_DEVICE_ROLE_LEADER:
			/* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */

			break;
		default:
			/* USER CODE BEGIN DEFAULT */
			/* USER CODE END DEFAULT */
			break;
		}
	}
}

/**
 * @brief  Warn the user that an error has occurred.In this case,
 *         the LEDs on the Board will start blinking.
 *
 * @param  pMess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_TraceError(const char *pMess, uint32_t ErrCode)
{
	/* USER CODE BEGIN TRACE_ERROR */
	//APP_DBG("**** Fatal error = %s (Err = %d)", pMess, ErrCode);
	/* USER CODE END TRACE_ERROR */
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated information
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void)
{
	WirelessFwInfo_t wireless_info_instance;
	WirelessFwInfo_t *p_wireless_info = &wireless_info_instance;

	if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
	{
		APP_THREAD_Error((uint32_t) ERR_THREAD_CHECK_WIRELESS,
				(uint32_t) ERR_INTERFACE_FATAL);
	}
	else
	{
		switch (p_wireless_info->StackType)
		{
		case INFO_STACK_TYPE_THREAD_FTD:
			APP_DBG("FW Type : Thread FTD")
			;
			break;
		case INFO_STACK_TYPE_THREAD_MTD:
			APP_DBG("FW Type : Thread MTD")
			;
			break;
		case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC:
			APP_DBG("FW Type : Static Concurrent Mode BLE/Thread")
			;
			break;
		default:
			/* No Thread device supported ! */
			APP_THREAD_Error((uint32_t) ERR_THREAD_CHECK_WIRELESS,
					(uint32_t) ERR_INTERFACE_FATAL);
			break;
		}
		APP_DBG("**********************************************************");
	}
}

/**
 * @brief Handler called when the server receives a COAP request.
 *
 * @param pContext : Context
 * @param pHeader : Header
 * @param pMessage : Message
 * @param pMessageInfo : Message information
 * @retval None
 */

static void APP_THREAD_CoapPermissionsRequestHandler(void *pContext,
		otMessage *pMessage, const otMessageInfo *pMessageInfo)

{
	SHCI_C2_RADIO_AllowLowPower(THREAD_IP, FALSE);
	coapConnectionEstablished = true;
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_RESET);
	/* USER CODE BEGIN APP_THREAD_CoapRequestHandler */
	//printIPv6Addr(&aMessageInfo->mPeerAddr);
	brAddr = pMessageInfo->mPeerAddr;
	otError error = OT_ERROR_NONE;
	otMessage *responseMessage;
	otCoapCode responseCode = OT_COAP_CODE_CHANGED;
	otCoapCode messageCode = otCoapMessageGetCode(pMessage);

	responseMessage = otCoapNewMessage((otInstance*) pContext, NULL);

	otCoapMessageInitResponse(responseMessage, pMessage,
			OT_COAP_TYPE_ACKNOWLEDGMENT, responseCode);
	otCoapMessageSetToken(responseMessage, otCoapMessageGetToken(pMessage),
			otCoapMessageGetTokenLength(pMessage));
	otCoapMessageSetPayloadMarker(responseMessage);

	uint16_t offset = otMessageGetOffset(pMessage);
	otMessageRead(pMessage, offset, resource_name, sizeof(resource_name) - 1);

	if (OT_COAP_CODE_GET == messageCode)
	{

		error = otMessageAppend(responseMessage, "ack", 3);
		error = otCoapSendResponse((otInstance*) pContext, responseMessage,
				pMessageInfo);
	}
	else
	{
		error = otMessageAppend(responseMessage, "nack", 4);
		otCoapMessageSetCode(responseMessage, OT_COAP_CODE_METHOD_NOT_ALLOWED);
		error = otCoapSendResponse((otInstance*) pContext, responseMessage,
				pMessageInfo);
	}

	if (error != OT_ERROR_NONE && responseMessage != NULL)
	{
		otMessageFree(responseMessage);
	}

	SHCI_C2_RADIO_AllowLowPower(THREAD_IP, TRUE);
}

/**
 * @brief Task associated to the push button.
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendCoapMsg(char *buf)
{
	if (!coapConnectionEstablished
			&& otThreadGetDeviceRole(sInstance) != OT_DEVICE_ROLE_CHILD)
		return;
	SHCI_C2_RADIO_AllowLowPower(THREAD_IP, FALSE);
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_SET);
	//SHCI_C2_RADIO_AllowLowPower(THREAD_IP, FALSE);

	sht4x_read(&sensor_data.temp_main, &sensor_data.humidity);
	stts22h_temperature_raw_get(&sensor_data.temp_aux);

	int8_t state;
	int8_t ret = app_algo_proc(sensor_data, false, &state);
	if (ret == RES_HEAT)
		sht4x_activate_medium_heater(); // heat sensor for 0.1s if receive signal RES_HEAT from algo
	int8_t rssi;
	otThreadGetParentLastRssi(sInstance, &rssi);
	/** CoAP Payload String (max <90 chars) **
	 * device_type (uint8_t): internal use number for indicating sensor type
	 * eui64 (uint32_t): unique id MSB
	 * eui64 (uint32_t): unique id LSB
	 * temp_main (int32_t): radar algo state
	 * humidity (int32_t): radar presence score
	 * temp_aux (int16_t): radar presence distance
	 * rssi (int8_t): last rssi from parent
	 * appCoapSendTxCtr (uint32_t): total CoAP transmissions
	 */
	snprintf(tmp_tx_buf, 254,
			"%d,%02x%02x%02x%02x%02x%02x%02x%02x,%ld,%ld,%ld,%d,%ld,%d",
			device_type, eui64.m8[0], eui64.m8[1], eui64.m8[2], eui64.m8[3],
			eui64.m8[4], eui64.m8[5], eui64.m8[6], eui64.m8[7],
			sensor_data.temp_main, sensor_data.humidity, sensor_data.temp_aux,
			rssi, state, ret);
	buf = tmp_tx_buf;
	APP_DBG("In appthread handler temp:%d hum:%d temp_aux:%d",
			sensor_data.temp_main, sensor_data.humidity, sensor_data.temp_aux);
	otError error = OT_ERROR_NONE;
	otMessage *message = NULL;
	otMessageInfo messageInfo;
	uint16_t payloadLength = 0;

	// Default parameters
	otCoapType coapType = OT_COAP_TYPE_NON_CONFIRMABLE;
	otIp6Address coapDestinationIp = brAddr;
	message = otCoapNewMessage(sInstance, NULL);

	otCoapMessageInit(message, coapType, OT_COAP_CODE_PUT);
	otCoapMessageGenerateToken(message, OT_COAP_DEFAULT_TOKEN_LENGTH);
	error = otCoapMessageAppendUriPathOptions(message, resource_name);

	payloadLength = strlen(buf);

	if (payloadLength > 0)
	{
		error = otCoapMessageSetPayloadMarker(message);

